rails/app/controllers/petitions_controller.rb

  def index
    @petitions = Petition.all
---
SELECT "petitions".* FROM "petitions"